'use client';

import Breadcrumb from '@/components/common/breadcrumb/DynamicBreadcrumbs';
import { DEFAULt_LINE_HEIGHT } from '@/constants/general';
import { BreadcrumbTypes } from '@/services/types/setting';
import { Stack, Typography } from '@mui/material';
import React from 'react';

const TermsPage = () => {
  // TODO: read from multilingual
  const termsSections = [
    {
      title: '۱. تعاریف و اصطلاحات باشگاه تخفیفی رویال الیت',
      content: ` پلتفرم دیجیتالی است که به منظور ارائه تخفیف به اعضا در تعامل با کسب‌وکارها (پذیرندگان) ایجاد شده است. `,
    },
    {
      title: '',
      content: ` عضو: هر شخص حقیقی که به عضویت باشگاه درآمده و از تخفیفات ارائه‌شده استفاده می‌کند`,
    },
    {
      title: '',
      content: `پذیرنده: هر شخص حقیقی یا حقوقی که از طریق رویال الیت، خدمات یا محصولات خود را به اعضای باشگاه با تخفیف ارائه می‌دهد. `,
    },
    {
      title: '',
      content: `تخفیف: درصد یا مبلغ مشخصی که از قیمت محصول یا خدمت کسر می‌شود و تنها به اعضای باشگاه رویال الیت تعلق می‌گیرد. `,
    },

    {
      title: '۲. شرایط عضویت و پذیرندگی',
      content: `۲.۱ شرایط عضویت اعضا: عضویت در باشگاه برای اشخاص دارنده کارت‌های بانکی عضو شبکه شتاب امکان‌پذیر است.
        عضویت در باشگاه رایگان است و اعضا ملزم به تکمیل فرآیند ثبت‌نام و ارائه اطلاعات دقیق و به‌روز هستند.
        هر عضو مسئولیت صحت اطلاعات خود را بر عهده دارد و باشگاه حق دارد در صورت ارائه اطلاعات نادرست یا تخلف، عضویت شخص را لغو کند. اعضا ملزم به استفاده صحیح و قانونی از تخفیفات بوده و حق واگذاری دسترسی خود به افراد دیگر را ندارند.`,
    },
    {
      title: '',
      content: `2.2 شرایط پذیرندگی برای کسب‌وکارها پذیرندگان موظف به ارائه مدارک موردنیاز و تکمیل فرم عضویت به عنوان کسب‌وکار در باشگاه رویال الیت هستند. پذیرندگان موظف‌اند به تخفیف مورد توافق عمل کنند و هرگونه تغییر در شرایط تخفیف باید با هماهنگی و تایید باشگاه باشد. پذیرندگان متعهد به ارائه خدمات و کالاها با کیفیت مناسب و رعایت استانداردهای لازم هستند. باشگاه رویال الیت مسئولیتی در قبال کیفیت یا نحوه ارائه خدمات پذیرندگان ندارد. `,
    },
    {
      title: '۳. نحوه استفاده از تخفیفات',
      content: `۳.۱ شرایط استفاده اعضا تنها مجاز به استفاده از تخفیفاتی هستند که توسط باشگاه رویال الیت و در وب‌سایت یا اپلیکیشن باشگاه ارائه شده است. تخفیفات تنها در خریدهای حضوری یا آنلاین از پذیرندگانی که در سامانه باشگاه اعلام شده‌اند معتبر است و در مواردی ممکن است تخفیف محدود به نوع خاصی از خدمات یا کالاها باشد. استفاده از تخفیف منوط به رعایت شرایط و قوانین باشگاه و پذیرنده بوده و اعضا ملزم به احترام به این قوانین هستند. `,
    },
    {
      title: '',
      content: `۳.2 موارد استثنا برخی از پذیرندگان ممکن است در محصولات یا خدمات خاصی تخفیف ارائه ندهند. این موارد استثنا در وب‌سایت رویال الیت یا توسط پذیرنده مشخص می‌شود و اعضا موظف به رعایت آن هستند. تخفیف‌ها در صورت وجود خطا در سیستم یا تغییرات قانونی ممکن است تغییر یابند یا لغو شوند.  `,
    },
    {
      title: '۴.  حفظ حریم خصوصی جمع‌آوری و استفاده از داده‌ها  ',
      content: `اطلاعاتی که اعضا و پذیرندگان در اختیار باشگاه می‌گذارند تنها برای ارائه خدمات و تسهیل استفاده از باشگاه جمع‌آوری می‌شود و باشگاه به حریم خصوصی اعضا و پذیرندگان احترام می‌گذارد. امنیت اطلاعات: باشگاه از روش‌های امنیتی پیشرفته برای حفظ اطلاعات شخصی اعضا و پذیرندگان استفاده می‌کند و تمامی اطلاعات به‌صورت محرمانه نگهداری می‌شود. `,
    },
    {
      title: '۵. حقوق و تعهدات طرفین',
      content: `۵.۱ حقوق و تعهدات اعضا و پذیرندگان اعضا موظف به استفاده قانونی و صحیح از تخفیفات و رعایت تمامی مقررات باشگاه و پذیرندگان هستند. پذیرندگان متعهد به ارائه تخفیفات تعیین‌شده به اعضا و ارائه خدمات مطابق با شرایط قرارداد هستند. هرگونه تخلف از سوی عضو یا پذیرنده ممکن است منجر به لغو عضویت یا قطع همکاری با باشگاه شود.`,
    },
    {
      title: '',
      content: `۵.2  حق تغییرات در شرایط باشگاه حق دارد در هر زمان قوانین و مقررات را تغییر دهد و تغییرات از طریق وب‌سایت به اطلاع اعضا و پذیرندگان خواهد رسید. اعضا و پذیرندگان با ادامه استفاده از خدمات باشگاه، تغییرات را می‌پذیرند.`,
    },
    {
      title: '۶. رویه‌های شکایت و حل اختلافات نحوه ثبت شکایات ',
      content: `اعضا و پذیرندگان می‌توانند شکایات خود را از طریق بخش پشتیبانی باشگاه رویال الیت ثبت کنند. تیم پشتیبانی تمام تلاش خود را برای حل اختلافات به کار می‌گیرد. رویه حل اختلافات: در صورتی که شکایتی به‌صورت داخلی حل نشود، طرفین می‌توانند از مراجع قضایی جهت حل اختلاف استفاده کنند. `,
    },
    {
      title: ' ۷.محدودیت‌ها و موارد عدم مسئولیت باشگاه رویال الیت ',
      content: `رویال الیت در قبال کیفیت محصولات و خدمات ارائه‌شده توسط پذیرندگان مسئولیتی ندارد. همچنین باشگاه مسئولیتی در قبال هرگونه خسارت احتمالی ناشی از استفاده از تخفیفات نخواهد داشت. در صورتی که به دلایلی خارج از کنترل باشگاه، ارائه تخفیفات یا دسترسی به خدمات به‌طور موقت یا دائم مختل شود، باشگاه مسئولیتی در قبال ضرر و زیان احتمالی اعضا و پذیرندگان ندارد. `,
    },
    {
      title: '۸. خاتمه عضویت باشگاه رویال الیت',
      content: `باشگاه رویال الیت حق دارد در صورت نقض قوانین توسط هر یک از اعضا یا پذیرندگان، عضویت آن‌ها را خاتمه دهد. اعضا و پذیرندگان موظف به رعایت تعهدات خود حتی پس از لغو عضویت هستند و هرگونه بدهی یا مسئولیت مالی که در نتیجه استفاده از خدمات باشگاه ایجاد شده باشد، به عهده عضو یا پذیرنده خواهد بود.`,
    },
  ];

  return (
    <>
      <Breadcrumb capitalizeLinks bradCrumbType={BreadcrumbTypes.Navigation} />
      <Stack spacing={3} p={3}>
        {termsSections.map((section, index) => (
          <Stack key={index} spacing={1}>
            {section.title && (
              <Typography variant="h5" fontWeight={600}>
                {section.title}
              </Typography>
            )}
            <Typography
              variant="body1"
              textAlign="justify"
              lineHeight={DEFAULt_LINE_HEIGHT}
            >
              {section.content}
            </Typography>
          </Stack>
        ))}
      </Stack>
    </>
  );
};

export default TermsPage;
